{"posts":[{"title":"Characterization of a Novel Cell- Wall anchored protein in the multi-host pathogen Group B Streptococcus","text":"This research was conducted at the Roslin Institute under the supervision of Dr. Nicola Lynskey for a period of six months. The aim of this research is to investigate the surface protein of GBS that is responsible for causing bovine mastitis, a devastating health problem among cows.Group B Streptococcus (GBS) is a commensal pathogen of humans and a major cause of mastitis in dairy cattle. GBS’s nature of infecting multiple hosts is due to the distinctive genomic structure and the presence of several virulence factors where cell-wall-associated protein is one of the key components involved in colonization and invasion. Therefore, understanding the virulence mechanism of this one health-concerned pathogen is a prerequisite for future interventions. Here, we aimed to characterize a novel cell-wall-anchored protein in GBS isolated from a bovine strain with mastitis. Initially, we designated the protein as the Bovine adhesion protein of GBS (BapB). Bioinformatic analysis revealed BapB as a member of Antigen I/II family polypeptide adhesins, which are found widely across the Streptococcus genus. Further analysis using PHYRE2 modeling of BapB showed a close association with the major cell-surface adhesion protein of S. mutans antigen I/II protein. More importantly, antigen I/II protein has never been characterized by bovine strain, imparting a novel finding in the field of veterinary health. We found that BapB when expressed on the surface of the non-pathogenic bacterium Lactococcus lactis confers adherence to epithelial cells, more firmly to bovine mammary epithelial. Moreover, the autoaggregation phenotype presented by BapB strongly supports its role in adherence to host epithelial cells.Collectively, these findings establish a new bacterial adhesion protein in the bovine strain that could be a potential virulence factor in bovine-associated infection. Further investigation on whether BapB is essential for colonization could provide a target for vaccine candidates.","link":"/2018/12/09/cellwall_anchored_protein/"},{"title":"Distribution and Comparison of Human Papilloma Virus Genotype in Cervical Cancer in Ecological Region of Nepal","text":"Cervical cancer is the second most common cancer among women worldwide, affecting an estimated 490,000 women each year, and causing 270,000 deaths annually. About 85% of this global burden of cervical cancer is experienced in sub-Saharan Africa, South and South-East Asia, Oceania, Central, and South America and the Caribbean. Although cervical cancer risk has substantially declined among women in developed countries due to effective cervical cytology screening programs, cervical cancer continues to be the most common cause of premature death among middle-aged women in their most productive years and the largest single cause of year life lost to cancer in developing countries.Cervical cancer is the second most common cancer among women in low- and middle-income countries (LMICs), where resources for cancer prevention programs are often less. According to the most recent report available, from NCRP 2005, cervical cancer accounts for 21.4% of all cancer in women of Nepal, appearing most frequently in women aged 35–64. It is the second most common after lung cancer in both men and women. To date, the information on HPV in Nepal is limited. There is considerable variation in the number of cervicovaginal and cervical cancer reports across Nepal, with most reports originating from hospital-based registries in selected urban areas because there is no national cancer registry. We aimed to detect the most common virus (Human Papillomavirus) responsible for cervical cancer in women. The samples were collected from 15 to 65 years of women within the reproductive age group after the informed consent form. Visual inspection with acetic acid (VIA) was performed followed by a Pap smear. Moreover, the sample with abnormal or unusual cells found during your Pap smear will be further interpreted through molecular examination. Accordingly, the study will be helpful for the management of disease and prevention of risk factors to minimize the disease burden area in Nepal and other parts of the world. Findings will be disseminated through various means of communication like conferences, publications, and books","link":"/2018/12/09/human_papilloma_virus/"},{"title":"Detection of Biofilm Production and its association with Multidrug Resistance Pattern of the isolates from the clinical samples","text":"Biofilm refers to a microbially-derived sessile community, consisting of cells that are attached to a substratum, interface, or to each other, embedded in an Extracellular Polymeric Substance (EPS) matrix. It serves as a means of self-defense, resisting physical forces, phagocytosis, and hindering the penetration of antibiotics. It is associated with several human infections and today‘s challenge to many antimicrobials. This prospective cross-sectional study was conducted in International Friendship Children Hospital, Maharajgunj, Kathmandu over a 3-months period to detect biofilm formation and its association with multidrug resistance (MDR). Staphylococcus aureus was the most commonly isolated organism followed by Escherichia coli. More than half isolates showed an MDR pattern where Methicillin Resistant Staphylococcus aureus (MRSA) was detected commonly followed by Extended Spectrum β- lactamase (ESBL). Within MRSA, a high rate of inducible clindamycin resistance (D - Test) was identified.Moreover, it was found that the Tube adherent (TA) method was able to give more significant results than the Congo Red Agar (CRA) method. S. aureus and E. coli were found to be the most frequent biofilm producers. Antimicrobial resistance was found more highly in biofilm-producing isolates than biofilm non-producing isolates. Among the biofilm-producing isolates, Amoxicillin was the most resistant one followed by Cotrimoxazole whereas Gentamycin was the most effective one followed by Chloramphenicol. More than half of MDR isolates were biofilm producers and the statistical tool Chi-square showed an association between biofilm production and multidrug resistance. Hence, It is very essential to initiate the reconnaissance of the antimicrobial susceptibility of biofilm-associated organisms so that it will create an empirical antimicrobial therapy for drug-resistant infections.","link":"/2018/12/09/biofilm_production/"},{"title":"National Anti-Tuberculosis Drug Resistance Survey 2021, Nepal","text":"Tuberculosis (TB) remains a major public health problem in Nepal. Globally, an estimated 10.0 million people fell ill with TB in 2019. There is an urge to develop mitigating strategies to eradicate TB in the population. Besides, the major issue here is the resistance pattern shown by the Mtb which is difficult to detect in a population and as a result, the drug resistance TB is escalating each year due to the lack of proper management and more importantly due to not having a strong surveillance tool to determine it. Hence, this survey aimed to determine the prevalence of pulmonary TB patients with multi-drug resistant/rifampicin resistant tuberculosis (MDR/RR-TB). The project targets seven provinces of Nepal and currently, the project is running.","link":"/2018/12/09/tuberculosis/"}],"tags":[],"categories":[{"name":"Project","slug":"Project","link":"/categories/Project/"}],"pages":[{"title":"","text":"BioI am a passionate microbiologist who enjoys working with microorganisms. Identifying and investigating the role of microorganisms in disease mechanisms has always amazed me, which led me to choose the path of understanding the virulence of microorganisms. Hence, I aimed to determine the pathogen’s virulence that promotes resistance to measures taken to preclude the degree of infection. I completed my undergraduate in Medical Microbiology, a four-year program that provided immense learning of pathogens’ nature, ways of causing infection, and its tackling measures and diagnosis. This learning welcomed the opportunity to do a master’s in Infectious Diseases and One Health (IDOH), a fully funded Erasmus Mundus, Joint Master Degree program. It was like a roller coaster for me to embrace a tremendous knowledge of “One Health” from three different Universities (France, Spain, and the UK), which encouraged me to contribute to the field of infectious diseases. Such confidence grew in me during my assistantship as a Research Assistant (RA) at Kathmandu Center for Genomics and Research laboratory (KCGRL) for one year. This position expanded my knowledge of molecular understanding of microorganisms and set a platform for personality development. Likewise, my internship at the Department of Plant Resources under the Nepal Government established a stage for intellectual interaction. The experience was quite different from other research, where I worked with medicinally important plant extracts to determine the susceptibility pattern against microorganisms. Currently, I am working at the Center for Molecular Dynamics Nepal (CMDN) as a research assistant where research on public health, one health, and biodiversity is carried out.","link":"/index.html"},{"title":"Curriculum Vitae","text":"-&gt; Get my full CV Here &lt;-","link":"/cv/index.html"}]}